[Killed] BlockStatement
d/me/project/index.js:1:35
-exports.numeroPerfeito = (num) => {
-    if (!num) return null
-
-    var arrayResult = []
-    for (let index = 0; index < num; index++) {
-        if (num % index == 0) {
-            arrayResult.push(index)
-        }
-    }
-
-    var soma = 0
-    for (let indexResult = 0; indexResult < arrayResult.length; indexResult++) {
-        soma += arrayResult[indexResult]
-    }
-
-    return soma == num
-}
+exports.numeroPerfeito = (num) => {}
 
 exports.mediaIntersecao = (vetor1, vetor2) => {

[Timeout] BooleanLiteral
d/me/project/index.js:2:9
 exports.numeroPerfeito = (num) => {
-    if (!num) return null
+    if (num) return null
 
     var arrayResult = []

[Timeout] ConditionalExpression
d/me/project/index.js:2:9
 exports.numeroPerfeito = (num) => {
-    if (!num) return null
+    if (false) return null
 
     var arrayResult = []

[Timeout] ArrayDeclaration
d/me/project/index.js:4:23
 exports.numeroPerfeito = (num) => {
     if (!num) return null
 
-    var arrayResult = []
+    var arrayResult = ["Stryker was here"]
     for (let index = 0; index < num; index++) {
         if (num % index == 0) {

[Timeout] EqualityOperator
d/me/project/index.js:5:25
     if (!num) return null
 
     var arrayResult = []
-    for (let index = 0; index < num; index++) {
+    for (let index = 0; index >= num; index++) {
         if (num % index == 0) {
             arrayResult.push(index)

[Timeout] BlockStatement
d/me/project/index.js:5:47
     if (!num) return null
 
     var arrayResult = []
-    for (let index = 0; index < num; index++) {
-        if (num % index == 0) {
-            arrayResult.push(index)
-        }
-    }
+    for (let index = 0; index < num; index++) {}
 
     var soma = 0

[Killed] EqualityOperator
d/me/project/index.js:6:13
 
     var arrayResult = []
     for (let index = 0; index < num; index++) {
-        if (num % index == 0) {
+        if (num % index != 0) {
             arrayResult.push(index)
         }

[Killed] ConditionalExpression
d/me/project/index.js:6:13
 
     var arrayResult = []
     for (let index = 0; index < num; index++) {
-        if (num % index == 0) {
+        if (true) {
             arrayResult.push(index)
         }

[Timeout] EqualityOperator
d/me/project/index.js:12:31
     }
 
     var soma = 0
-    for (let indexResult = 0; indexResult < arrayResult.length; indexResult++) {
+    for (let indexResult = 0; indexResult >= arrayResult.length; indexResult++) {
         soma += arrayResult[indexResult]
     }

[Timeout] UpdateOperator
d/me/project/index.js:12:65
     }
 
     var soma = 0
-    for (let indexResult = 0; indexResult < arrayResult.length; indexResult++) {
+    for (let indexResult = 0; indexResult < arrayResult.length; indexResult--) {
         soma += arrayResult[indexResult]
     }

[Killed] ConditionalExpression
d/me/project/index.js:16:12
         soma += arrayResult[indexResult]
     }
 
-    return soma == num
+    return true
 }
 

[Timeout] ConditionalExpression
d/me/project/index.js:16:12
         soma += arrayResult[indexResult]
     }
 
-    return soma == num
+    return false
 }
 

[Timeout] BlockStatement
d/me/project/index.js:19:47
     return soma == num
 }
 
-exports.mediaIntersecao = (vetor1, vetor2) => {
-    if (!vetor1 || !vetor2) return null
-
-    var arrayResult = []
-    for (let index1 = 0; index1 < vetor1.length; index1++) {
-        for (let index2 = 0; index2 < vetor2.length; index2++) {
-            if (vetor1[index1] == vetor2[index2]) {
-                arrayResult.push(vetor1[index1])
-            }
-        }
-    }
-
-    var soma = 0
-    for (let index = 0; index < arrayResult.length; index++) {
-        soma += arrayResult[index]
-    }
-
-    var media = arrayResult.length ? soma / arrayResult.length : 0
-
-    return media
-}
+exports.mediaIntersecao = (vetor1, vetor2) => {}
 

[Killed] ConditionalExpression
d/me/project/index.js:20:9
 }
 
 exports.mediaIntersecao = (vetor1, vetor2) => {
-    if (!vetor1 || !vetor2) return null
+    if (false) return null
 
     var arrayResult = []

[Killed] ConditionalExpression
d/me/project/index.js:20:9
 }
 
 exports.mediaIntersecao = (vetor1, vetor2) => {
-    if (!vetor1 || !vetor2) return null
+    if (true) return null
 
     var arrayResult = []

[Killed] BlockStatement
d/me/project/index.js:23:60
     if (!vetor1 || !vetor2) return null
 
     var arrayResult = []
-    for (let index1 = 0; index1 < vetor1.length; index1++) {
-        for (let index2 = 0; index2 < vetor2.length; index2++) {
-            if (vetor1[index1] == vetor2[index2]) {
-                arrayResult.push(vetor1[index1])
-            }
-        }
-    }
+    for (let index1 = 0; index1 < vetor1.length; index1++) {}
 
     var soma = 0

[Survived] EqualityOperator
d/me/project/index.js:23:26
     if (!vetor1 || !vetor2) return null
 
     var arrayResult = []
-    for (let index1 = 0; index1 < vetor1.length; index1++) {
+    for (let index1 = 0; index1 <= vetor1.length; index1++) {
         for (let index2 = 0; index2 < vetor2.length; index2++) {
             if (vetor1[index1] == vetor2[index2]) {

[Killed] EqualityOperator
d/me/project/index.js:24:30
 
     var arrayResult = []
     for (let index1 = 0; index1 < vetor1.length; index1++) {
-        for (let index2 = 0; index2 < vetor2.length; index2++) {
+        for (let index2 = 0; index2 >= vetor2.length; index2++) {
             if (vetor1[index1] == vetor2[index2]) {
                 arrayResult.push(vetor1[index1])

[Timeout] ConditionalExpression
d/me/project/index.js:24:30
 
     var arrayResult = []
     for (let index1 = 0; index1 < vetor1.length; index1++) {
-        for (let index2 = 0; index2 < vetor2.length; index2++) {
+        for (let index2 = 0; false; index2++) {
             if (vetor1[index1] == vetor2[index2]) {
                 arrayResult.push(vetor1[index1])

[Killed] BlockStatement
d/me/project/index.js:25:51
     var arrayResult = []
     for (let index1 = 0; index1 < vetor1.length; index1++) {
         for (let index2 = 0; index2 < vetor2.length; index2++) {
-            if (vetor1[index1] == vetor2[index2]) {
-                arrayResult.push(vetor1[index1])
-            }
+            if (vetor1[index1] == vetor2[index2]) {}
         }
     }

[Timeout] ConditionalExpression
d/me/project/index.js:25:17
     var arrayResult = []
     for (let index1 = 0; index1 < vetor1.length; index1++) {
         for (let index2 = 0; index2 < vetor2.length; index2++) {
-            if (vetor1[index1] == vetor2[index2]) {
+            if (false) {
                 arrayResult.push(vetor1[index1])
             }

[Killed] ConditionalExpression
d/me/project/index.js:32:25
     }
 
     var soma = 0
-    for (let index = 0; index < arrayResult.length; index++) {
+    for (let index = 0; false; index++) {
         soma += arrayResult[index]
     }

[Timeout] EqualityOperator
d/me/project/index.js:32:25
     }
 
     var soma = 0
-    for (let index = 0; index < arrayResult.length; index++) {
+    for (let index = 0; index >= arrayResult.length; index++) {
         soma += arrayResult[index]
     }

[Timeout] ArithmeticOperator
d/me/project/index.js:36:38
         soma += arrayResult[index]
     }
 
-    var media = arrayResult.length ? soma / arrayResult.length : 0
+    var media = arrayResult.length ? soma * arrayResult.length : 0
 
     return media
